using UnityEngine;
using System.Collections;

public class IpConfig
{
    public static System.UInt32[] ips = {
        0x2E051C73,	//"115.28.5.46",
		0x1B221D73,	//"115.29.34.27",
		0x168B506E,	//"110.80.139.22",
		0xF6FB1B75,	//"117.27.251.246",
		0x8EEF1B75,	//"117.27.239.142",
		0xA0FB1B75,	//"117.27.251.160",
		0x9BFB1B75,	//"117.27.251.155",
		0x059A1975,	//"117.25.154.5",
		0x028B506E,	//"110.80.139.2",
		0x86E13CB7,	//"183.60.225.134",
		0x8CE13CB7,	//"183.60.225.140",
		0x44425CB6,	//"182.92.66.68",
		0x33AE1878,	//"120.24.174.51",
		0x66C6C865,	//"101.200.198.102",
		0x5CF11D73,	//"115.29.241.92",
		0x9810582F,	//"47.88.16.152",
		0xAF3D727A,	//"122.114.61.175",
		0x1087506E,	//"110.80.135.16",
		0x1C87506E,	//"110.80.135.28",
		0x2387506E,	//"110.80.135.35",
		0x2487506E,	//"110.80.135.36",
		0x1387506E,	//"110.80.135.19",
		0x02BE6B71,	//"113.107.190.2",
		0x07BE6B71,	//"113.107.190.7",
		0x08BE6B71,	//"113.107.190.8",
		0x1087506E,	//"110.80.135.16",
		0x1C87506E,	//"110.80.135.28",
		//0x9A909377, //119.147.144.154
	};
    //登陆端口
    public static int LOGON_PORT = 11000;// new System.Random().Next(16050, 16069);
    //银行端口
    public static int BANK_PORT = 11000;
    //任务服务器端口
    public static int MISSION_PORT = 18226;
    //喇叭服务器端口
    public static int SPEAKER_PORT = 10010;
    //端口增减量
    public static int OFFSET_SERVER_PORT = 5000;
}
